In [6]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.preprocessing import MinMaxScaler, StandardScaler

### 1.1. Теоретический материал – Библиотека NumPy

NumPy (NumericalPython) - это библиотека Python с открытым исходным кодом, которая используется практически во всех областях науки и техники. Это универсальный стандарт для работы с числовыми данными в Python.

Если у вас уже есть Python, вы можете установить NumPy с помощью командной строки:

    pip install numpy

Чтобы начать использовать NumPy необходимо импортировать соответствующую библиотеку:

    import numpy as np

Основным объектом NumPy является однородный многомерный массив (в numpy называется numpy.ndarray). Это многомерный массив элементов (обычно чисел), одного типа.
Наиболее важные атрибуты объектов ndarray:

`ndarray.ndim` - число измерений (чаще их называют "оси") массива. ndarray.shape - размеры массива, его форма. Это кортеж натуральных
чисел, показывающий длину массива по каждой оси. Для матрицы из n строк и m столбов, shape будет (n,m). Число элементов кортежа shape равно ndim.

`ndarray.size` - количество элементов массива. Очевидно, равно произведению всех элементов атрибута shape.

`ndarray.dtype` - объект, описывающий тип элементов массива. Можно определить dtype, используя стандартные типы данных Python. NumPy здесь предоставляет целый букет возможностей, как встроенных, например: bool_, character, int8, int16, int32, int64, float8, float16, float32, float64, complex64, object_, так и возможность определить собственные типы данных, в том числе и составные.

`ndarray.itemsize` - размер каждого элемента массива в байтах.

`ndarray.data` - буфер, содержащий фактические элементы массива. Обычно не нужно использовать этот атрибут, так как обращаться к элементам массива проще всего с помощью индексов.

### 1.2.1 Пример

#### Задача:

Создать массив 5x2. Создать массив 5x2. Вывести все значения массива, значение элемента с индексом (3,1) и второй столбец. Индексация начинается с нуля.

#### Решение:

In [7]:
x = np.arange(1, 11).reshape((5, 2))
print(x)
print(x[3][1])
print(x[1])

[[ 1  2]
 [ 3  4]
 [ 5  6]
 [ 7  8]
 [ 9 10]]
8
[3 4]

### 1.2.2 Пример

#### Задача:

Пример. Выполнить следующее:

1. Создать вектор (одномерный массив) размера 10, заполненный нулями.
2. Создать вектор размера 10, заполненный единицами.
3. Создать вектор размера 10, заполненный заданным числом.
4. Создать вектор со значениями от 10 до 19.

#### Решение:

In [8]:
a = np.zeros(10)
b = np.ones(10)
c = np.full(10, 5)
d = np.arange(10, 20)
print(a, b, c, d, sep='\n')

[0. 0. 0. 0. 0. 0. 0. 0. 0. 0.]
[1. 1. 1. 1. 1. 1. 1. 1. 1. 1.]
[5 5 5 5 5 5 5 5 5 5]
[10 11 12 13 14 15 16 17 18 19]


#### Задача:

#### Решение:

### 1.2.3 Пример

#### Задача:
Создать массив 10x10 со случайными значениями, найти минимум, максимум и среднее значение.

#### Решение:

In [9]:
Z = np.random.random((10, 10))
Zmin, Zmax, Zmean = Z.min(), Z.max(), Z.mean()
print(Zmin, Zmax, Zmean)

0.006348158580686825 0.9925606002699331 0.47689311166930515

### 1.2.4 Пример:

#### Задача:

Задать матрицу размерности 5 на 5 и поменять 2 строки в матрице местами.

#### Решение:

In [10]:
A = np.arange(25).reshape(5, 5)
A[[0, 1]] = A[[1, 0]]
A

array([[ 5,  6,  7,  8,  9],
       [ 0,  1,  2,  3,  4],
       [10, 11, 12, 13, 14],
       [15, 16, 17, 18, 19],
       [20, 21, 22, 23, 24]])

### 1.2.5 Пример

#### Задача:

Выяснить результат следующих выражений:
- `0 * np.nan`
- `np.nan == np.nan`
- `np.inf > np.nan`
- `np.nan - np.nan`
- `0.3 == 3 * 0.1`

#### Решение:

In [11]:
print(
    0 * np.nan,
    np.nan == np.nan,
    np.inf > np.nan,
    np.nan - np.nan,
    0.3 == 3 * 0.1,
    sep='\n'
)

nan
False
False
nan
False

### 1.2.6 Пример

#### Задача:

Отсортировать массив.

#### Решение:

In [12]:
arr = np.array([2, 1, 3, 5, 7, 4, 6, 8])
print(np.sort(arr))

[1 2 3 4 5 6 7 8]

### 1.3.1 Задание

#### Задача:

Создать 8x8 матрицу и заполнить её в шахматном порядке нулями и
единицами.

#### Решение:

In [13]:
m = np.zeros((8, 8))
m[::2, ::2] = 1
m[1::2, 1::2] = 1
m

array([[1., 0., 1., 0., 1., 0., 1., 0.],
       [0., 1., 0., 1., 0., 1., 0., 1.],
       [1., 0., 1., 0., 1., 0., 1., 0.],
       [0., 1., 0., 1., 0., 1., 0., 1.],
       [1., 0., 1., 0., 1., 0., 1., 0.],
       [0., 1., 0., 1., 0., 1., 0., 1.],
       [1., 0., 1., 0., 1., 0., 1., 0.],
       [0., 1., 0., 1., 0., 1., 0., 1.]])

### 1.3.2 Задание

#### Задача:

Создать 5x5 матрицу со значениями в строках от 0 до 4. Для создания
необходимо использовать функцию `arange`.

#### Решение:

In [14]:
m = np.ones((5, 5)) * np.arange(5)

### 1.3.3 Задание

#### Задача:

Создать массив 3x3x3 со случайными значениями.

#### Решение:

In [15]:
m = np.random.random((3, 3, 3))
m

array([[[0.56798598, 0.57656365, 0.24013339],
        [0.98990745, 0.74717973, 0.4904743 ],
        [0.12638221, 0.17621228, 0.06292027]],

       [[0.48020235, 0.90078516, 0.89372173],
        [0.39375854, 0.8419574 , 0.6561373 ],
        [0.11712059, 0.36008903, 0.59632545]],

       [[0.39917381, 0.84897085, 0.5359377 ],
        [0.04976273, 0.47934837, 0.77497348],
        [0.99109382, 0.41626489, 0.20130665]]])

### 1.3.4 Задание

#### Задача:

Создать матрицу с 0 внутри, и 1 на границах.

#### Решение:

In [16]:
m = np.ones((7, 7))
m[1:-1:, 1:-1:] = 0
m

array([[1., 1., 1., 1., 1., 1., 1.],
       [1., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 1.],
       [1., 0., 0., 0., 0., 0., 1.],
       [1., 1., 1., 1., 1., 1., 1.]])

### 1.3.5 Задание

#### Задача:

Создайте массив и отсортируйте его по убыванию.

#### Решение:

In [17]:
arr = np.random.randint(1, 100, 10)
print(arr)
arr[::-1].sort()
print(arr)

[ 3  3 28 19 45 95 30 39  2 84]
[95 84 45 39 30 28 19  3  3  2]

### 1.3.6 Задание

#### Задача:

Создайте матрицу, выведите ее форму, размер и размерность.

#### Решение:

In [18]:
m = np.arange(10).reshape((5, 2))
print(m)
print(m.shape, m.ndim)

[[0 1]
 [2 3]
 [4 5]
 [6 7]
 [8 9]]
(5, 2) 2

### 2.1 Теоретический материал – Библиотека Pandas
Первым шагом в любом начинании в области машинного обучения является введение исходных данных в систему. Исходные данные могут вводиться вручную, содержаться в файле или храниться в интернете в каком- либо формате. Кроме того, часто требуется получить данные из нескольких источников.

_Библиотека pandas_ – это удобный и быстрый инструмент для работы с данными, обладающий большим функционалом. Если очень кратко, то pandas – это библиотека, которая предоставляет очень удобные с точки зрения использования инструменты для хранения данных и работе с ними.

_Библиотека pandas_ присутствует в стандартной поставке Anaconda.
Если же ее там нет, то его можно установить отдельно. Для этого введите командной строке:

    pip install pandas

Для импорта библиотеки используйте команду:

    import pandas as pd

_Библиотека pandas_ предоставляет две ключевые структуры данных: `Series` и `DataFrame`.
`Series` – это одномерная структура данных, ее можно представить, как таблицу с одной строкой. С `Series` можно работать как с обычным массивом (обращаться по номеру индекса), и как с ассоциированным массивом, когда можно использовать ключ для доступа к элементам данных.
`DataFrame` – это двумерная структура. Идейно она очень похожа на обычную таблицу, что выражается в способе ее создания и работе с ее элементами.

### 2.2.1 Пример

#### Задача:

Создать Series из списка Python, словаря Python, и массива Numpy (установить буквенные метки для последнего).

#### Решение:

In [19]:
lst = [1, 2, 3, 4, 5]
d = {'a': 1, 'b': 2, 'c': 3}
ndarr = np.array([1, 2, 3, 4, 5])

s1 = pd.Series(lst)
s2 = pd.Series(d)
s3 = pd.Series(ndarr, ['a', 'b', 'c', 'd', 'e'])

print(s1)
print(s2)
print(s3)

0    1
1    2
2    3
3    4
4    5
dtype: int64
a    1
b    2
c    3
dtype: int64
a    1
b    2
c    3
d    4
e    5
dtype: int64

### 2.2.2 Пример

#### Задача:

Дано два Series. Напечатать их первые элементы и все элементы после третьего (во втором фрейме).

#### Решение:

In [20]:
s1 = pd.Series([1, 2, 3, 4, 5], ['a', 'b', 'c', 'd', 'e'])
s2 = pd.Series([5, 4, 3, 2, 1])
print(s1['a'])
print(s2[0])
print(s2[3:])

1
5
3    2
4    1
dtype: int64

### 2.2.3 Пример

#### Задача:

Создайте новый фрейм данных.

#### Решение:

In [21]:
df = pd.DataFrame({
    'Имя': ['Джеки Джексон', 'Стивен Стивенсон'],
    'Возраст': [38, 25],
    'Водитель': [True, False],
})
df

                Имя  Возраст  Водитель
0     Джеки Джексон       38      True
1  Стивен Стивенсон       25     False

### 2.2.4 Пример

#### Задача:

Загрузите фрейм данных по [ссылке](https://raw.githubusercontent.com/chrisalbon/simulated_datasets/master/titanic.csv).

#### Решение:

In [22]:
df = pd.read_csv('./data/titanic.csv')
df.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

### 2.2.5 Пример

#### Задача:

Пронализировать характеристики фрейма данных.

#### Решение:

Одна из самых простых вещей, которые мы можем сделать после загрузки данных, – это взглянуть на первые несколько строк с помощью метода head. На последние строки можно посмотреть с помощью функции tail. Мы также можем взглянуть на количество строк и столбцов: dataframe.shape. Кроме того, используя метод describe, мы можем получить описательную статистику для любых числовых столбцов.

In [23]:
df.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [24]:
df.tail(3)

                  Name PClass   Age   Sex  Survived  SexCode
1310  Zenni, Mr Philip    3rd  22.0  male         0        0
1311  Lievens, Mr Rene    3rd  24.0  male         0        0
1312    Zimmerman, Leo    3rd  29.0  male         0        0

In [25]:
df.shape

(1313, 6)

In [26]:
df.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

Более подробно с возможностями работы с фреймами данных можно узнать по [ссылке](https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.html).

### 2.2.6 Пример

#### Задача:

Выберите индивидуальные данные или срезы фрейма данных.

#### Решение:

Для выбора одной или нескольких строк, либо значений, можно использовать методы 1ос или iloc.

In [27]:
df.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

### 2.2.7 Пример

#### Задача:

Требуется отобрать строки фрейма данных на основе некоторого условия. Необходимо сформировать новый фрейм данных из пассажиров первого класса.

#### Решение:

In [28]:
df[df.PClass == '1st'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

### 2.3.1 Задание


#### Задача:

Найдите евклидово расстояние между двумя Series (точками) a и b, не
используя встроенную формулу.

#### Решение:

In [29]:
a = pd.Series([0, 0])
b = pd.Series([3, 4])

(((b - a) ** 2).sum()) ** 0.5

5.0

### 2.3.2 Задание


#### Задача:

Найдите в Интернете ссылку на любой csv файл и сформируйте из него фрейм данных (например, коллекцию фреймов данных можно найти [здесь](https://github.com/akmand/datasets).

#### Решение:

In [30]:
df = pd.read_csv('./data/adult.csv')
df.head(5)

,age,workclass,education_num,marital_status,occupation,relationship,race,gender,hours_per_week,native_country,capital,income_status
0,39,State-gov,13,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,2174,<=50K
1,50,Self-emp-not-inc,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,0,<=50K
2,38,Private,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,0,<=50K
3,53,Private,7,Married-civ-spouse,Handlers-cleaners,Husband,Other,Male,40,United-States,0,<=50K
4,28,Private,13,Married-civ-spouse,Prof-specialty,Wife,Other,Female,40,Other,0,<=50K

### 2.3.3 Задание


#### Задача:

Проделайте с получившемся из предыдущего задания фреймом данных
те же действия, что и в примерах 2.2.5-2.2.7.

#### Решение:

In [31]:
df.head(2)

,age,workclass,education_num,marital_status,occupation,relationship,race,gender,hours_per_week,native_country,capital,income_status
0,39,State-gov,13,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,2174,<=50K
1,50,Self-emp-not-inc,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,0,<=50K

In [32]:
df.tail(3)

,age,workclass,education_num,marital_status,occupation,relationship,race,gender,hours_per_week,native_country,capital,income_status
45219,38,Private,13,Married-civ-spouse,Prof-specialty,Husband,White,Male,50,United-States,0,<=50K
45220,44,Private,13,Divorced,Adm-clerical,Own-child,Other,Male,40,United-States,5455,<=50K
45221,35,Self-emp-inc,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,60,United-States,0,>50K

In [33]:
df.shape

(45222, 12)

In [34]:
df.describe()

                age  education_num  hours_per_week       capital
count  45222.000000   45222.000000    45222.000000  45222.000000
mean      38.547941      10.118460       40.938017   1012.834925
std       13.217870       2.552881       12.007508   7530.315380
min       17.000000       1.000000        1.000000  -4356.000000
25%       28.000000       9.000000       40.000000      0.000000
50%       37.000000      10.000000       40.000000      0.000000
75%       47.000000      13.000000       45.000000      0.000000
max       90.000000      16.000000       99.000000  99999.000000

In [35]:
df.iloc[1:4]

,age,workclass,education_num,marital_status,occupation,relationship,race,gender,hours_per_week,native_country,capital,income_status
1,50,Self-emp-not-inc,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,0,<=50K
2,38,Private,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,0,<=50K
3,53,Private,7,Married-civ-spouse,Handlers-cleaners,Husband,Other,Male,40,United-States,0,<=50K

In [36]:
df[df.age > 30].head(5)

,age,workclass,education_num,marital_status,occupation,relationship,race,gender,hours_per_week,native_country,capital,income_status
0,39,State-gov,13,Never-married,Adm-clerical,Not-in-family,White,Male,40,United-States,2174,<=50K
1,50,Self-emp-not-inc,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,13,United-States,0,<=50K
2,38,Private,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,40,United-States,0,<=50K
3,53,Private,7,Married-civ-spouse,Handlers-cleaners,Husband,Other,Male,40,United-States,0,<=50K
5,37,Private,14,Married-civ-spouse,Exec-managerial,Wife,White,Female,40,United-States,0,<=50K

### 3.1. Теоретический материал – Работа с числовыми данными

Количественные данные что-то измеряют – будь то размер класса,
ежемесячные продажи или оценки учащихся. Естественным способом представления этих величин является численным (например, 150 студентов, 529 392 продаж).

Нормализация данных — это общепринятая задача предобработки в машинном обучении. Многие алгоритмы предполагают, что все признаки находятся в единой шкале, как правило, от 0 до 1 или от -1 до 1.

Существует множество способов нормализации значений признаков, чтобы масштабировать их к единому диапазону и использовать в различных моделях машинного обучения. В зависимости от используемой функции, их можно разделить на 2 большие группы: линейные и нелинейные. При нелинейной нормализации в расчетных соотношениях используются функции логистической сигмоиды или гиперболического тангенса. В линейной нормализации изменение переменных осуществляется пропорционально, по линейному закону.

На практике наиболее распространены следующие методы нормализации признаков:

**Минимакс** – линейное преобразование данных в диапазоне [0..1], где минимальное и максимальное масштабируемые значения
соответствуют 0 и 1 соответственно;

$$
X_{norm} = \frac{X - X_{min}}{X_{max} - X_{min}}
$$

**Z-масштабирование** данных на основе среднего значения и
стандартного отклонения: производят деление разницы между переменной и средним значением на стандартное отклонение.

$$
z = \frac{x-μ}{σ}
$$

При масштабировании данных мы будем использовать одну из популярных библиотек машинного обучения _Scikit-learn_. Библиотека содержит пакет sklearn.preprocessing, который предоставляет широкие возможности для нормализации данных. Следует отметить, что в целом алгоритмы обучения выигрывают от стандартизации набора данных.

### 3.2.1. Пример

#### Задача:

Прошкалируйте числовой признак в диапазон между двумя значениями.

#### Решение:

In [37]:
feature = np.array([-500.5, -100.1, 0, 100.1, 900.9]).reshape((5, 1))
minmax_scaler = MinMaxScaler(feature_range=(0, 1))
scaled_feature = minmax_scaler.fit_transform(feature)
scaled_feature

array([[0.        ],
       [0.28571429],
       [0.35714286],
       [0.42857143],
       [1.        ]])

### 3.2.2. Пример

#### Задача:

Преобразуйте признак, чтобы он имел среднее значение 0 и стандартное
отклонение 1.

#### Решение:

In [38]:
x = np.array([-1000.1, -200.2, 500.5, 600.6, 9000.9]).reshape((5, 1))
standard = StandardScaler().fit_transform(x)
standard

array([[-0.76058269],
       [-0.54177196],
       [-0.35009716],
       [-0.32271504],
       [ 1.97516685]])

Мы можем увидеть эффект стандартизации, обратившись к среднему значению и стандартному отклонению результата нашего решения:

In [39]:
round(standard.mean()), standard.std()

(0, 1.0)

### 3.2.3. Пример

#### Задача:

Дан фрейм данных

    dfTest = pd.DataFrame({
        'A':[14.00,90.20,90.95,96.27,91.21],
        'B':[103.02,107.26,110.35,114.23,114.68],
        'C':['big','small','big','small','small']
    })

Необходимо масштабировать его числовые столбцы.

#### Решение:

In [40]:
scaler = MinMaxScaler()
dfTest = pd.DataFrame({
    'A': [14.00, 90.20, 90.95, 96.27, 91.21],
    'B': [103.02, 107.26, 110.35, 114.23, 114.68],
    'C': ['big', 'small', 'big', 'small', 'small']
})
dfTest[['A', 'B']] = scaler.fit_transform(dfTest[['A', 'B']])
dfTest

          A         B      C
0  0.000000  0.000000    big
1  0.926219  0.363636  small
2  0.935335  0.628645    big
3  1.000000  0.961407  small
4  0.938495  1.000000  small

### 3.3.2. Задание

#### Задача:

Загрузить фрейм данных по [ссылке](https://raw.githubusercontent.com/akmand/datasets/master/iris.csv).

Необходимо выполнить нормализацию первого числового признака (sepal_length_cm) с использованием минимаксного преобразования, а второго (sepal_width_cm) с задействованием z-масштабирования.
#### Решение:

In [41]:
df = pd.read_csv('https://raw.githubusercontent.com/akmand/datasets/master/iris.csv')
df.head()

   sepal_length_cm  sepal_width_cm  petal_length_cm  petal_width_cm species
0              5.1             3.5              1.4             0.2  setosa
1              4.9             3.0              1.4             0.2  setosa
2              4.7             3.2              1.3             0.2  setosa
3              4.6             3.1              1.5             0.2  setosa
4              5.0             3.6              1.4             0.2  setosa

In [42]:
minmax_scaler = MinMaxScaler()
z_scaler = StandardScaler()

df[['sepal_length_cm']] = minmax_scaler.fit_transform(df[['sepal_length_cm']])
df[['sepal_width_cm']] = z_scaler.fit_transform(df[['sepal_width_cm']])

df.head()

   sepal_length_cm  sepal_width_cm  petal_length_cm  petal_width_cm species
0         0.222222        1.032057              1.4             0.2  setosa
1         0.166667       -0.124958              1.4             0.2  setosa
2         0.111111        0.337848              1.3             0.2  setosa
3         0.083333        0.106445              1.5             0.2  setosa
4         0.194444        1.263460              1.4             0.2  setosa